---
kind: type
id: T:Autodesk.Revit.DB.Visual.BumpmapType
source: html/c86fe875-6d55-b286-c28d-7e0bcc243f2a.htm
---
# Autodesk.Revit.DB.Visual.BumpmapType

The enumerated type representing the permitted values for the asset property "BumpmapType" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public enum BumpmapType
```